# MajorSheetAlignment Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricArea..::..MajorSheetAlignment Property
FabricArea Class See Also
---
The fabric sheet alignment in the fabric distribution in the major direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FabricSheetAlignment MajorSheetAlignment { get; set; }
```

Visual Basic
---
```text
Public Property MajorSheetAlignment As FabricSheetAlignment
	Get
	Set
```

Visual C++
---
```text
public:
property FabricSheetAlignment MajorSheetAlignment {
	FabricSheetAlignment get ();
	void set (FabricSheetAlignment value);
}
```

# Remarks
Changing the value of this property causes change of MajorLapSplice and LapSplicePosition properties if needed
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace